# Advanced Databases 2025/2026 
### Prof. Márcia Barros and Prof. Francisco Couto
TP2 - Week3

# Part 1
Follow the tutorial in https://www.w3schools.com/python/python_mysql_getstarted.asp and solve the exercises bellow, using the provided dataset dias_catalogue.csv.

### Exercise 1 - Connect to a Database

Write Python code to connect to a local MySQL server (using mysql.connector) and create a new database called astronomy_db.
Note: Use pip install mysql-connector-python if you don't have the mysql-connector-python library installed

### Exercise 2 - Create a Table

Create a table named star_clusters with the same columns as your CSV (name, RA_ICRS, DE_ICRS, r50, …, REF). Choose appropriate MySQL data types (VARCHAR, FLOAT, INT, etc.).

### Exercise 3 - Insert One Row

Insert one row manually into star_clusters (e.g., the first row from your dataset).

### Exercise 4 - Insert Multiple Rows from CSV

Write a Python script to loop through your CSV file and insert all rows into the table.
(Hint: use csv module + executemany() for efficiency.)

### Exercise 5 - Select All Rows

Query the database to print all records where DiamMax_pc > 20.

### Exercise 6 - Select Specific Columns

Query only the columns name, RA_ICRS, DE_ICRS, and Diam_pc where Plx > 1.

### Exercise 7 - Update a Value

Update the age of one specific star cluster (choose by name) to a new value. Print the number of affected rows.

### Exercise 8 - Delete a Row

Delete a star cluster from the table where name = 'NGC 188' (or any existing entry from your dataset).

### Exercise 9 - Search with LIKE

Find all star clusters whose name starts with "NGC". Print their name and dist_PLX.

### Exercise 10 - Aggregate Function

Count how many star clusters have FeH < 0 (metal-poor). Print the total number.

# PART 2
Follow the tutorial in https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html# and solve the exercises bellow, using the provided dataset dias_catalogue.csv.

### Exercise 1 - Selecting Columns

Select only the columns name, RA_ICRS, DE_ICRS, V_r, and Plx from the dataset.

Hint: In SQL, this would be similar to SELECT name, RA_ICRS, DE_ICRS, Vr, Plx FROM dataset.

### Exercise 2 - Filtering Rows

Find all rows where the age is greater than 1.

Hint: In SQL: SELECT * FROM dataset WHERE age > 1.

### Exercise 3 - Sorting Data

Sort the dataset by Plx in descending order and display the top 10 rows.

Hint: SQL equivalent: SELECT * FROM dataset ORDER BY Plx DESC LIMIT 10.

### Exercise 4 - Aggregation

Calculate the average metallicity (FeH) for clusters with more than 10 stars (N > 10).

### Exercise 5 - Grouping and Counting

Count how many clusters have a flagdispPM of 1 and a sigPM greater than 2.

# Part 3 - Bonus!

Exercise: Inserting Stellar Cluster Data into MySQL

Objective:
Use pandas and a MySQL connector to load your dias_catalogue.csv dataset into a MySQL table.

pip install sqlalchemy

In [ ]:
import pandas as pd
from sqlalchemy import create_engine, text
import numpy as np

# Load CSV
df = pd.read_csv("dias_catalogue.csv")

# clean the dataset
df = df.replace('', None)
df.replace([np.inf, -np.inf], np.nan, inplace=True)


# Create a connection to MySQL
# Replace user, password, host, port, database_name with your info
#engine = create_engine("mysql+mysqlconnector://user:password@host:port/database_name")
engine = create_engine("mysql+mysqlconnector://root:1234@localhost:3306/")
# Execute raw SQL to create database
with engine.connect() as conn:
    conn.execute(text("CREATE DATABASE IF NOT EXISTS astro_database"))
    conn.commit()
engine = create_engine("mysql+mysqlconnector://root:1234@localhost:3306/astro_database")

0      -10.870
1      -16.353
2      -14.302
3          NaN
4          NaN
         ...
1753       NaN
1754       NaN
1755       NaN
1756    27.580
1757       NaN
Name: Vr, Length: 1758, dtype: float64

In [2]:
# If the table does not exist, it will be created automatically
df.to_sql(name='stellar_clusters', con=engine, if_exists='replace', index=False)

1758